{
  "@context": {
    "ldp": "http://www.w3.org/ns/ldp#",
    "schema": "http://schema.org/",
    "fedora": "http://fedora.info/definitions/v4/repository#",
    "webac": "http://fedora.info/definitions/v4/webac#",
    "acl": "http://www.w3.org/ns/auth/acl#",
    "ucdlib": "http://digital.ucdavis.edu/schema#",
    "ebucore": "http://www.ebu.ch/metadata/ontologies/ebucore/ebucore#"
  },
  "@id": "",
  "@type": [
    "ldp:BasicContainer",
    "schema:Collection",
    "http://fedora.info/definitions/v4/repository#ArchivalGroup"
  ],
  "ucdlib:hasLabel": {
    "@id": "@base:/labels"
  },
  "schema:about": [
    {
      "@id": "http://id.worldcat.org/fast/1423689"
    },
    {
      "@id": "http://id.worldcat.org/fast/1423874"
    },
    {
      "@id": "http://id.worldcat.org/fast/1692637"
    }
  ],
  "schema:creator": [
    {
      "@id": "http://id.loc.gov/authorities/names/no2014099630",
      "schema:name": "Eastman, Jervie Henry"
    },
    "Riesen, John D",
    "Simmons, Mirl H",
    "Thompson, Peter Julian \"Jack\"",
    "Loomis, Benjamin Franklin",
    "Myers & Loomis",
    "Eastman, Jervie Henry"
  ],
  "schema:identifier": "ark:/13030/tf6w100646",
  "schema:datePublished": {
    "@type": "http://www.w3.org/2001/XMLSchema#date",
    "@value": "1997"
  },
  "schema:description": "Jervie Henry Eastman was born, July 20, 1880, in White Cloud, Michigan. His family moved to northern California in 1886. In 1898, Eastman launched his photographic career in Sisson, California (later named Mount Shasta), as a view photographer. He became a partner in the Shasta View Company in 1907. Eastman lost his entire stock of plates and cards in a fire in 1912. In 1921, Jervie Henry Eastman moved to Susanville and established Eastman & Company as a commercial photography and post card studio. In 1936 he hired Mirl Simmons, a young photographer from Hillsborough, West Virginia, to help with the postcard photography. In 1947, Eastman and Simmons became partners. The business had expanded to provide photographic supplies to southeastern Oregon and studios in Westwood, Weed, and Susanville. Eastman retired from photography in 1959 and sold his share of the business to Simmons. He died in Susanville on February 11, 1969. Simmons ran the Eastman Studios until 1980, when he retired and sold the business to John and Shirley Castle. Mirl Simmons died on April 27, 1987, in Jamestown, California. From 1983 to 1993, George F. Kliewer owned Eastman Studios in Susanville. Following George Kliewer’s death, his wife Marilyn worked with friend and photographer Henry Martinez, Jr. to organize and index the negatives. Marilyn Kliewer subsequently sold the business and offered the photograph collection to Henry Martinez. A portion of the Eastman's Originals Collection (the historical postcards and negatives) was sold to Anne Fisher in 1982. She managed this portion of the collection until her retirement in 1994, at which time she donated the materials to the University of California, Davis. Following the sale of Eastman Studios, Henry Martinez, Jr. purchased the portion of the collection remaining with the studio. These images, which include all of George F. Kliewer’s works, were donated to the University of California, Davis in 2019. \n\n The collection finding aid is available at the [Online Archive of California](https://oac.cdlib.org/findaid/ark:/13030/tf6w100646/).",
  "schema:keywords": [
    "Photographs",
    "1895/1980",
    "California, Northern",
    "Pictorial Works"
  ],
  "schema:license": {
    "@id": "http://rightsstatements.org/vocab/InC-NC/1.0/"
  },
  "schema:name": "Eastman's Originals Collection",
  "schema:publisher": [
    {
      "@id": "http://id.loc.gov/authorities/names/no2008108707",
      "schema:name": "University of California, Davis. General Library. Dept. of Special Collections"
    }
  ]
}
